import React from 'react'
import './about.scss'
export default function About() {
    return (
        <div id='about'>
            <h2>Բարի գալուստ  Solar Master</h2>
            <span>Ձեր լավագույն ընտրությունը</span>
            <hr/>
            <h4>Մեր մասին</h4>
            <p>Solar Master-ում մենք հասկանում ենք արևի էներգիայի փոխակերպիչ ազդեցությունը ինչպես ձեր տան, այնպես էլ շրջակա միջավայրի վրա: Փորձագետների նվիրված թիմով մենք պարտավորվում ենք տրամադրել բացառիկ արևային լուծումներ, որոնք բավարարում են ձեր էներգետիկ կարիքները: Նախնական խորհրդատվությունից մինչև վերջնական տեղադրում, մենք կենտրոնանում ենք որակի և նորարարության վրա՝ ապահովելով, որ ձեր արևային ծրագրի բոլոր ասպեկտները մշակվեն խնամքով և ճշգրտությամբ:</p>
            <p>
                Անկախ նրանից՝ դուք ցանկանում եք նվազեցնել ձեր էներգիայի ծախսերը, բարձրացնել ձեր գույքի արժեքը կամ նպաստել ավելի կանաչ մոլորակի ստեղծմանը, մենք այստեղ ենք՝ օգնելու ձեզ հասնել ձեր նպատակներին: Բացահայտեք կայուն էներգիայի առավելությունները Solar Master-ի հետ:</p>
        </div>
    )
}
