import React from 'react'
import './service.scss'
import nkar1 from './../../images/nkar1.jpeg'
import nkar2 from './../../images/nkar2.jpeg'
import nkar3 from './../../images/nkar3.jpeg'

export const serviceData = [
    {
        img: nkar1,
        title: "24 / 7",
        service:"Խորհրդատվություն",
        text: "Մեր արևային խորհրդատվական ծառայությունը հարմարեցված է, որպեսզի օգնի ձեզ հասկանալ ձեր սեփականության լավագույն արևային տարբերակները: Անկախ նրանից՝ բնակելի, թե առևտրային, մեր բանիմաց թիմը գնահատում է ձեր էներգիայի օգտագործումը, գնահատում ձեր կայքը և առաջարկում օպտիմալ լուծումներ, որոնք առավելագույնի են հասցնում արդյունավետությունը:"
    },
    {
        img: nkar2,
        title: "Պատվեր",
        service: "Պատվերով արևային համակարգի ձևավորում",

        text: "Ընդլայնեք ձեր էներգետիկ անկախությունը մեր հատուկ արևային համակարգի դիզայնի ծառայության միջոցով, որտեղ մենք իրականություն ենք դարձնում ձեր էներգետիկ նպատակները: Մեր փորձառու ինժեներները մանրակրկիտ նախագծում են համակարգեր, որոնք լիովին համապատասխանում են ձեր գույքի բնութագրերին և էներգիայի կարիքներին:"
    },
    {
        img: nkar3,
        title: "Շահույթ",
        service: "Էներգաարդյունավետության խորհրդատվություն",

        text: "Առավելագույնի հասցրեք ձեր արևային ներդրումները մեր Էներգաարդյունավետության խորհրդատվական ծառայության միջոցով: Մեր փորձառու թիմը կօգնի ձեզ բացահայտել սպառումը նվազեցնելու և ձեր արևային համակարգի արդյունավետությունը բարձրացնելու հնարավորությունները՝ երաշխավորելով, որ դուք առավելագույն օգուտ կքաղեք ձեր ներդրումներից:"
    }
]

export default function Service() {
    return (
        <div id='service'>
            <h2>Մենք առաջարկում ենք արևային էներգիայի ծառայություններ</h2>
            <h3>Մեր Ծառայությունները</h3>
            <p>
                Դիզայնից մինչև տեղադրում մենք աշխատում ենք ձեզ հետ ձեռք ձեռքի տված՝ ստեղծելու արդյունավետ արևային լուծումներ,
                որոնք համապատասխանում են ձեր ապրելակերպին: Փորձեք հարմարեցված էներգետիկ լուծումներ, որտեղ յուրաքանչյուր մանրուք մշակված է ձեր հատուկ կարիքներին համապատասխան Խորհրդատվություն
            </p>
            <div className='service'>
                {serviceData.map((elem, index) => (
                    <div className='blocks' key={index}>
                        <img src={elem.img} alt="solar master pictures" />
                        <h2>{elem.service}</h2>
                        <h4>{elem.title}</h4>
                        <p>{elem.text}</p>
                    </div>
                ))}
            </div>
        </div>
    )
}
